[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a road construction site.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 84 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to start the search by identifying potential areas with road construction signs or equipment. The coordinates (28, 56) and (56, 56) are marked with \"-56, 56\", which indicates they might be near construction sites. I should move towards these coordinates to begin the search.</Reasoning>\n<Action>(28, 56, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 74 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have moved closer to the coordinates (28, 56), which have a height of -56 meters. It seems like these coordinates could still be near construction areas. I need to move slightly more towards the south to investigate further.</Reasoning>\n<Action>(21, 43, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 64 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have moved closer to the coordinates (25, 49), which have a height of -49 meters. It looks like these coordinates could be near the construction site. I will continue moving south to get an even closer view.</Reasoning>\n<Action>(17, 42, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 54 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now centered over the coordinates (28, 0), which have a height of 0 meters. I need to move slightly to the east to get a better view of the surroundings and determine if any signs of construction are visible.</Reasoning>\n<Action>(29, 1, -10)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to take an emergency stop because I am too close to an object and risk hitting it. I will hover at my current altitude to assess the situation and ensure safety before proceeding.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (21, 43) are marked with \"-43, 43,\" which indicate that they might be near the construction site. I will move slightly to the east to investigate further.</Reasoning>\n<Action>(21, 44, -10)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to take an emergency stop because I am too close to an object and risk hitting it. I will hover at my current altitude to assess the situation and ensure safety before proceeding.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am still not over the construction site. I need to move further north to get closer to coordinates with negative values, which might indicate construction.</Reasoning>\n<Action>(10, 27, -10)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to take an emergency stop because I am too close to an object and risk hitting it. I will hover at my current altitude to assess the situation and ensure safety before proceeding.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am still not over the construction site. I need to move further north to get closer to coordinates with negative values, which might indicate construction.</Reasoning>\n<Action>(8, 25, -10)</Action>"
    ]
]