[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 45 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to start the search for the anomaly. I will move towards the point (0, 0) to center myself over a potential location in the middle of the street, where an object might stand out from the surroundings.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 45 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now centered over the point (0, 0) as instructed. I need to make a decision based on the surroundings to proceed with the search. Given the symmetrical layout and the presence of vehicles, I will move slightly south to (0, -15) to check another part of the street below, which might reveal a potential anomaly.</Reasoning>\n<Action>(0, -15, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 45 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I flew too close and need to increase altitude immediately. I will move to (0, 0, 30) to raise the drone 30 meters to avoid the obstruction.</Reasoning>\n<Action>(0, 0, 30)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 75 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>It seems I am not seeing any potential anomalies from this height. To continue the search, I will move slightly east to (25, 0) to consider another area of the street below, hoping to find something unusual.</Reasoning>\n<Action>(25, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 75 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to increase altitude again to avoid the obstruction. I will move to (0, 0, 50) to ensure I have a safe distance from any potential hazards.</Reasoning>\n<Action>(0, 0, 50)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 75 meters, which means that you can only fly 45 meters higher."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the confusion. To increase altitude safely without exceeding 120 meters, I will move to (0, 0, 25) to raise the drone 25 meters.</Reasoning>\n<Action>(0, 0, 25)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 100 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to adjust my search area for the anomaly. I will move east to (33, 0) to explore another part of the street below, as this might contain the object of interest.</Reasoning>\n<Action>(33, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 100 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to increase altitude immediately to avoid the obstruction. I will move to (0, 67, 0) to raise the drone 67 meters to ensure safety.</Reasoning>\n<Action>(0, 67, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 100 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have reassessed the situation from a higher altitude and need to focus on the ground level. I will move south to (0, 33, 0) to center over the intersection, where an object might be visible.</Reasoning>\n<Action>(0, 33, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 100 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to increase altitude again to avoid the obstruction. I will move to (0, 0, 67) to raise the drone 67 meters.</Reasoning>\n<Action>(0, 0, 67)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 100 meters, which means that you can only fly 20 meters higher."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the oversight. To safely increase altitude without exceeding 120 meters, I will move to (0, 0, 20) to raise the drone 20 meters.</Reasoning>\n<Action>(0, 0, 20)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 120 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have reached the maximum allowable altitude. Given the constraints and the current perspective, I will move south to (-40, 0) to consider another part of the street below, as this might help me locate the anomaly.</Reasoning>\n<Action>(-40, 0, 0)</Action>"
    ]
]