[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a fire.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 84 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be a street view from above. Since I'm looking for a fire, I need to scan the area systematically. I notice there might be some activity near the coordinates (0, 28), where there appears to be something yellow on the road. I should move closer to investigate this area and reduce altitude to get a better view.</Reasoning>\n<Action>(0, 28, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 54 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can now see a yellow object more clearly near coordinates (0, -18). It could potentially be the fire I'm looking for. I should move closer to that location and further reduce altitude to get a better view and confirm if this is indeed what I'm searching for.</Reasoning>\n<Action>(0, -18, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 24 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can now see what appears to be a yellow taxi on the street. I need to check if there's any fire nearby. Let me descend further and stay centered on this area to get a clearer view, while maintaining the same x,y coordinates since this seems like the most promising location to investigate.</Reasoning>\n<Action>(0, 0, -15)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I have a very clear view of a yellow taxi, but I don't see any fire in the vicinity. I need to continue my search elsewhere. Let me move to explore the northern part of the area since we haven't checked there yet, while maintaining a relatively low altitude for better visibility.</Reasoning>\n<Action>(0, 18, 15)</Action>"
    ],
    [
        "Role.USER",
        "This command would endanger the drone, as you would fly out of bounds of the last seen image, possibly flying into unknown territories, recklessly. Please adjust your command so that you don't fly out of bounds of the last glimpse."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the unsafe command. You're right. Looking at the grid overlay in the last image, I should stay within the visible bounds. Let me move to (0, 6) which is still within our visible range and slightly increase altitude to get a wider view of the surroundings.</Reasoning>\n<Action>(0, 6, 15)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 24 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this new vantage point, I still don't see any signs of fire. Let me check the western side of the street where there appears to be some darker areas that should be investigated. I'll move towards (-8, 0) while maintaining this altitude for now.</Reasoning>\n<Action>(-8, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 24 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I notice what might be smoke or steam in the lower left portion of the image near (-8, -16). I should investigate this area more closely by moving towards it and reducing altitude to get a better view.</Reasoning>\n<Action>(-8, -16, -15)</Action>"
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be some steam or smoke coming from the ground near (-3, -6). I need to move closer to this location to confirm if this might be related to a fire.</Reasoning>\n<Action>(-3, -6, -4)</Action>"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 4 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this low altitude, I can see what appears to be some discoloration or wetness on the ground, but I don't see any active fire. I should check the area near (-1, -3) where there seems to be some unusual marking on the ground.</Reasoning>\n<Action>(-1, -3, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 4 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>After completing a thorough search of the visible area at various altitudes and locations, I have not found any active fire. What I initially thought might be smoke appears to be road markings, wetness, or discoloration on the pavement. Since I've now used all 9 allowed moves and haven't found a fire, I should conclude the search.</Reasoning>\n<Action>I have completed the search but found no fire.</Action>"
    ]
]