[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 58 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to narrow down the search area to find the anomaly. The northern part of the grid might contain the object as there are no points at coordinates like (0, 0). I will move slightly north to explore this area further.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 58 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object appears to be located in the central part of the grid, near coordinates (0, 0). I will adjust my position to be directly above this point to get a clear view and confirm if it's the anomaly.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 58 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is indeed at coordinates (0, 0), which is directly below me. I will now descend to 10 meters to verify if it is an anomaly.</Reasoning>\n<Action>(0, 0, -48)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is located at coordinates (0, 0). I am already very close to it, so I will maintain my altitude and position to get a detailed view to confirm it's the anomaly.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to get a closer view to confirm the object's details. Since it's at coordinates (0, 0), I will ascend slightly to 12 meters to ensure I have a better angle before descending back to 10 meters for a detailed check.</Reasoning>\n<Action>(0, 0, 4)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still at coordinates (0, 0), and I am at a suitable altitude to get a detailed view. I will hover at this altitude to ensure I have a clear view of the object and confirm its anomaly status.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am directly above the object, which is at coordinates (0, 0). The object appears distinct from the surroundings, confirming it as the anomaly. I will now descend to ensure I am below 10 meters for the final check.</Reasoning>\n<Action>(0, 0, -6)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is at coordinates (0, 0). I am at a suitable altitude to inspect it closely. I will hover near this point to confirm the anomaly's details.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 2 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is at coordinates (0, 0). I am already close, so I will adjust slightly to the north to get a clearer view and confirm the anomaly's details.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is at coordinates (0, 0). I am very close, so I will hover to get a detailed view to confirm it's the anomaly.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ]
]