[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a building.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 91 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom my current position at 91 meters altitude, I can see a fairly wide area but need to get lower to better identify potential buildings. I notice what appears to be a brownish structure or area near the center of the image around coordinates (0, 0). To investigate this more closely, I'll move to that position and reduce altitude by 40 meters to get a better view while still maintaining enough height to keep good visibility.\n</Reasoning>\n<Action>(0, 0, -40)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see a building structure more clearly in the lower-left portion of the image, around coordinates (-33, -17). I need to move to that location and reduce altitude further to get below 10 meters as required. I'll descend by 42 meters to get to approximately 8 meters above ground level, which will satisfy the requirement of being below 10 meters.\n</Reasoning>\n<Action>(-33, -17, -42)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI am currently at 8 meters altitude which is good (below 10 meters as required), but I need to move slightly to get a better view of the building structure. I can see it's a bit to my right and down, around coordinates (-3, -3). I'll maintain the same altitude since it's already optimal and just adjust my position to center on the building.\n</Reasoning>\n<Action>(-3, -3, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nNow I can see what appears to be a structure right ahead of me, slightly to the right at coordinates (3, -3). I'm already at the perfect altitude of 8 meters (below 10 meters as required), so I'll just move to center directly over the building while maintaining the same altitude.\n</Reasoning>\n<Action>(3, -3, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see the building clearly centered in my view at my current position. I am at 8 meters altitude which is perfect as it's below the required 10 meters, and I am centered directly over the target building. All conditions are met: I'm below 10 meters, the building is in my field of view, and I'm centered on it.\n</Reasoning>\nFOUND"
    ]
]