[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a person.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 84 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to start a systematic search pattern to find the person. Given the large area, I'll first move to a central position and lower my altitude to get a better view. I'll head to (0, 0) which is the center of the grid and decrease altitude by 30 meters to get a clearer view of the terrain.\n</Reasoning>\n<Action>(0, 0, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 53 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this altitude, I can see the terrain better but still need to get lower to spot a person. I notice some clearings in the grassy area. I'll move slightly towards (0, 18) and continue descending to get a better view of the northern section, reducing altitude by another 30 meters.\n</Reasoning>\n<Action>(0, 18, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 22 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nAt this lower altitude, I can see much more detail. I notice something in the area around (7, 7) that requires closer inspection. I'll move to that position and lower the altitude by 13 meters to get within the required 10-meter range for identification.\n</Reasoning>\n<Action>(7, 7, -13)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see a person near coordinate (0, 3). I am already at a good altitude of 8 meters, which is below the required 10 meters, and I'll move to center directly over their position for a clear view.\n</Reasoning>\n<Action>(0, 3, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 7 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now clearly see the person in my field of view. I am at an optimal altitude of 7 meters, which is well below the required 10 meters, and I am centered on their position. This meets all the requirements - the person is in view, I am below 10 meters altitude, and I am centered on the target.\n</Reasoning>\nFOUND"
    ]
]