[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object appears to be located near coordinates (0, 0) on the grid, where there is a dark spot amidst the surroundings. Since this is the center of the grid, it is logical to start the search there from a higher altitude to ensure a broad overview. Moving upwards initially will help in assessing the surroundings and then proceeding to lower altitudes for a closer inspection. It's crucial to stay within the field of view and adjust the altitude accordingly.</Reasoning>\n<Action>(0, 0, 30)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 62 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near coordinates (0, 0) on the grid. Since it remains in the same location, I should continue to lower the altitude to move closer to it. This approach will help in confirming whether the object is indeed the anomaly from a closer perspective.</Reasoning>\n<Action>(0, 0, -30)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still located near coordinates (0, 0) on the grid. Given that I am currently at a lower altitude (32 meters) and still need to get closer to the object, moving slightly northward will help me approach it more directly. This adjustment will ensure I am in the right position to evaluate the object closely in my next move.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is now near coordinates (0, -1) on the grid. Since the object has moved slightly southward, I need to adjust my position accordingly. Moving slightly southward will help me align with the object's new location and get closer to it.</Reasoning>\n<Action>(0, -1, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is located near coordinates (0, 0) on the grid. Although I am currently at an appropriate altitude, I need to adjust my position to be more directly aligned with the object, which will help in getting closer and confirming if it is the anomaly.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near coordinates (0, 0) on the grid, and it appears slightly more towards the east. Given the object's position, moving slightly westward will help me center on it and get closer, allowing for a more precise inspection.</Reasoning>\n<Action>(-1, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is situated near coordinates (0, 0) on the grid, and I am already above it. To ensure I am centered on the object, moving slightly southward will help me adjust my position and get closer, allowing for a better inspection.</Reasoning>\n<Action>(0, -1, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 22 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near coordinates (0, 0) on the grid, and it is now positioned directly below me (z=0). Given that I am already quite close, moving slightly northward will help me ensure I am centered on it and maintain a low altitude for a precise inspection.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 22 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near coordinates (0, 0) on the grid, and it appears slightly more towards the east. Given the object's position, moving slightly westward will help me center on it and get closer, allowing for a more precise inspection.</Reasoning>\n<Action>(-1, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 12 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is now near coordinates (0, 0) on the grid, indicating it is directly below me. Since I am already at a very close altitude of 12 meters, moving slightly southward will help me ensure I am centered on it and maintain a precise inspection position.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ]
]