[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a fire.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be a small yellow/orange spot near the center of the image that could potentially be a fire. Since I need to get closer to confirm and need to be below 10 meters to mark it as found, I'll move directly to that position and significantly reduce altitude to about 8 meters to ensure I'm within the required range.</Reasoning>\n<Action>(0, 0, -25)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this lower altitude, I can see that what I thought might be a fire appears to be a yellow taxi or similar vehicle. I need to continue searching for the actual fire. I'll move to explore a different area while maintaining a relatively low altitude to ensure good visibility.</Reasoning>\n<Action>(0, 5, 2)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I still don't see any signs of fire in this area. I'll move towards the north-east direction to explore a new area, while staying at a relatively low altitude to maintain good visibility of the ground.</Reasoning>\n<Action>(3, 7, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>There's still no sign of fire in this area. I notice we haven't explored much of the eastern side of the search area. I'll move further east while maintaining this altitude to continue the search.</Reasoning>\n<Action>(7, 7, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Still no signs of fire in this area. Let's move south to explore that section while maintaining our current altitude. This will give us a good view of a previously unexplored area.</Reasoning>\n<Action>(7, -3, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the unsafe movement. I notice there are structures that need to be avoided. Let's move to a safer position by heading west, away from the buildings and structures, while maintaining our altitude.</Reasoning>\n<Action>(3, 3, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to be more careful about obstacles. Given the structures and buildings in the area, I should first gain some altitude to safely maneuver, then move to a clearer area. I'll increase height by 20 meters and move towards the west where there appears to be more open space.</Reasoning>\n<Action>(0, 0, 20)</Action>"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 30 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this higher vantage point, I can see better. I notice what appears to be smoke or a possible fire near the yellow striped area in the distance. I'll move towards that location while maintaining enough altitude to safely navigate, then prepare to descend once I'm closer.</Reasoning>\n<Action>(0, 20, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 30 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I can see these are just yellow road markings/crosswalks, not fire. Since this was my last allowed move and I haven't found the fire yet, I have to conclude the search was unsuccessful. I need to ensure I report that the fire was not found within my search parameters and movement limitations.</Reasoning>\n<Action>Search concluded - Fire not found within the allowed moves and search area</Action>"
    ]
]