[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a large trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 80 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be a construction or debris area in the lower left quadrant of the image. I'll move towards that area and lower my altitude to get a better look at potential trash piles. Moving to coordinates (-53, -27) and descending 40 meters to get closer.</Reasoning>\n<Action>(-53, -27, -40)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 40 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this new position, I can see a clearer view of the area. I notice some construction materials and possible debris piles on the left side. I'll move to (-27, -13) and continue descending to get an even closer look at what appears to be a work/construction area where trash piles might be located.</Reasoning>\n<Action>(-27, -13, -20)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 25 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the unsafe maneuver. From this position, I need to move to a safer location and continue my search. I see some areas to explore on the right side of the image. I'll move to (17, 8) while maintaining the current altitude to stay safe from obstacles.</Reasoning>\n<Action>(17, 8, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 25 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to get a broader view of the area as I'm currently too close to structures. I'll move back to gain a better perspective and increase altitude slightly to ensure safe clearance from obstacles. Moving to (0, 17) and going up 15 meters to search more effectively.</Reasoning>\n<Action>(0, 17, 15)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 25 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to get out of this confined space near the structures. Let's move to a safer position by heading to (-17, -17) while maintaining current altitude. This will give me more room to maneuver and continue the search from a safer vantage point.</Reasoning>\n<Action>(-17, -17, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 25 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I appear to be in a dangerous position near structures. First priority is to gain safe altitude before making any lateral movements. I'll increase altitude by 35 meters to get clear of obstacles, then can plan next search area from a safer vantage point.</Reasoning>\n<Action>(0, 0, 35)</Action>"
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 60 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I have a much better view of the area. I can see what appears to be a construction or work area in the left portion of the image near (-40, 20). I'll move in that direction while maintaining this safer altitude to investigate what could be the trash pile we're looking for.</Reasoning>\n<Action>(-40, 20, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 60 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can now see a large pile of construction materials and debris in the lower right quadrant of the image, near (40, -20). I'll move to that location and descend to get a closer look at what appears to be our target.</Reasoning>\n<Action>(40, -20, -51)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 19 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm too close to structures again and need to immediately gain altitude for safety. I'll ascend 41 meters to get back to a safer height where I can continue the search without risk of collision.</Reasoning>\n<Action>(0, 0, 41)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 10:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 22 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I've gotten into a dangerous situation near structural elements. The safest immediate action is to gain significant altitude without lateral movement to clear all obstacles. I'll increase altitude by 58 meters to reach a safe height of 80 meters.</Reasoning>\n<Action>(0, 0, 58)</Action>"
    ]
]