[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a building.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 75 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (25, 25) next. This area is relatively central and seems to have a mix of trees and open space, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(25, 25, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 74 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 0) next. This location seems to have a dense tree cover, which could potentially conceal a building.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 73 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (24, 24) next. This location appears to be central and surrounded by dense trees, which could indicate a hidden building.</Reasoning>\n<Action>(24, 24, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 72 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 24) next. This location is surrounded by trees and open space, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(0, 24, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 71 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (24, 0) next. This location is in the open space, which might indicate a potential hiding spot for a building or object.</Reasoning>\n<Action>(24, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 70 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 23) next. This location is in a dense forest area, which might indicate a potential hiding spot for a building or other object.</Reasoning>\n<Action>(0, 23, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 69 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 23) next. This location is at a low altitude with dense vegetation and a rocky area, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(0, 23, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 58 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 19) next. This location is at a low altitude with dense vegetation and rocks, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(0, 19, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 47 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 16) next. This location is surrounded by dense vegetation, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(0, 16, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 36 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The center of the grid moves to (0, 12) next. This location is at a low altitude with dense vegetation and some open spaces, which might indicate a potential hiding spot for a building.</Reasoning>\n<Action>(0, 12, -10)</Action>"
    ]
]