[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 81 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this altitude of 81 meters, I can see a good portion of the area but might miss smaller details like a trash pile. I notice mostly vegetation and some bare patches. To conduct an effective search, I should first lower my altitude significantly to get a better view of the ground details, while staying in a central position. I'll descend to about 30 meters altitude first, which will give me a much better view while still maintaining a decent search area.\n</Reasoning>\n<Action>(0, 0, -51)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nAt this lower altitude of 29 meters, I can see more details of the terrain. I notice something that looks like a structure or debris in the upper portion of the image. I'll move towards the coordinates (0, 19) to investigate that area more closely, while also descending further to get a better view. I'll reduce altitude by another 15 meters to get closer to the target height range.\n</Reasoning>\n<Action>(0, 19, -15)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 14 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now clearly see what appears to be the trash pile or debris near some structures at coordinates (0, 9). I'm currently at 14 meters altitude, which is still a bit high for our target of being below 10 meters. I'll position directly over the debris and descend by 6 meters, which will put me at 8 meters altitude - well within our target range of being below 10 meters while keeping the object in view.\n</Reasoning>\n<Action>(0, 9, -6)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 7 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI am now perfectly positioned at 7 meters altitude above what appears to be a collection of debris/trash, which includes what looks like containers, structures, and various materials. The object is clearly in my field of view, I am centered above it, and my altitude is below 10 meters (specifically at 7 meters), which meets all the requirements for completing the task.\n</Reasoning>\nFOUND"
    ]
]