[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a large trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 80 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is likely to be located in the bottom center of the image based on the given context and coordinates. The coordinates (0, 0) are centered and within the searchable area, which is logical to check first. Moving to this area will help in determining if this is the location of the large trash pile. I am lowering to 70 meters to keep within the search area and maintain visibility.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 70 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Since I am now at grid coordinates (0, 0), I can see the crosswalk indicating a possible location of the trash pile. Lowering the altitude closer to the ground will help confirm if this is the correct area. Moving to (0, 23) allows me to stay in the field of view and check the area around the crosswalk.</Reasoning>\n<Action>(0, 23, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 60 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The trash pile is lying on the ground, and I need to be as close to it as possible without flying too low. Moving to (0, 0) will center me over the crosswalk and allow me to descend to a close altitude to identify if this is the trash pile. Descending to 50 meters will help me stay within the search area and maintain visibility over the ground.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Since I am currently at grid coordinates (0, 0), I am directly over the crosswalk. I need to descend further to confirm if the trash pile is underneath me. Moving to (17, 17) while maintaining a low altitude will help me check the area closely without flying too low and potentially missing the object if it's not directly underneath.</Reasoning>\n<Action>(17, 17, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 40 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The trash pile is to the northeast of my current position, as indicated by the coordinates (0, 27). Moving in that direction will bring me closer to the suspected location. Lowering the altitude will help confirm if this is the trash pile without exceeding the search area limits.</Reasoning>\n<Action>(27, 27, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 30 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Since I am now at grid coordinates (0, 0), I can see a section of the road more clearly. Moving to (10, 0) places me closer to the yellow taxi seen in the image, which could be the trash pile. Lowering to 20 meters will help confirm this identification while staying within the search area and ensuring visibility.</Reasoning>\n<Action>(10, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 20 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am currently centered over the road, and moving to (0, 13) places me directly over where the trash pile appears to be located. Since the pile is already close, I need to lower to ensure I don't miss it. Reducing altitude to 10 meters will help confirm the presence of the trash pile.</Reasoning>\n<Action>(0, 13, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The trash pile is located directly underneath me at grid coordinates (0, 0). Since I am already at the correct vertical position, I need to ensure I am directly over the debris. Lowering slightly to 8 meters will provide a better view of the trash pile and confirm its location.</Reasoning>\n<Action>(0, 0, -1)</Action> \n<Reasoning>FOUND</Reasoning>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The trash pile is now directly under me, located at grid coordinates (0, 0). Since I am already at a low altitude, confirming the exact position is crucial. Lowering to 8 meters will ensure I am directly above the trash pile, verifying the identification.</Reasoning>\n<Action>(0, 0, -1)</Action> \n<Reasoning>FOUND</Reasoning>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now directly above the trash pile, as seen in the image with coordinates (0, 0). The debris is clearly visible, indicating I am at the correct location. Maintaining altitude at 9 meters ensures I do not miss any details of the trash pile.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ]
]