[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is most likely located at the center of the image, around coordinate (0, 0) since it's the convergence point of several coordinates in the image. I need to start the search from there and check the immediate area.</Reasoning>\n<Action>(0, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 42 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to adjust my position slightly to the south to better align with potential coordinates of the object based on the previous guidance. The new coordinates (0, -5) will help narrow down the search area, particularly moving closer to the lower middle section of the image.</Reasoning>\n<Action>(0, -5, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 41 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to move further south and lower to better investigate the area around the coordinates (0, 0), which is consistent with the previous guidance. The new position (0, -5, -8) allows for a closer inspection of the central region of the image.</Reasoning>\n<Action>(0, -5, -8)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 32 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Given the new coordinates (13, -5, -5), I am now closer to the coordinates (0, 0), suggesting a convergence point where the object might be located. Lowering altitude will help in inspecting potential anomalies more closely.</Reasoning>\n<Action>(13, -5, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 21 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fan is located near the coordinates (10, 0). I need to move closer to this area to investigate, so I will adjust to (10, 0, -5).</Reasoning>\n<Action>(10, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 15 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>To better investigate the central area where the object might be located, I will adjust to (5, 0, -5). This position brings me closer to potentially identify any anomalies.</Reasoning>\n<Action>(5, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I will adjust to (3, 0, -5) to better investigate the area around the coordinates (0, 0), moving closer to the center of the image.</Reasoning>\n<Action>(3, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I will adjust to (1, -1, -5) to further investigate the area around the coordinates (0, 0), moving closer to the center of the image.</Reasoning>\n<Action>(1, -1, -5)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I will adjust to (0, 0, 20) to safely increase altitude and avoid the immediate area of potential collision.</Reasoning>\n<Action>(0, 0, 20)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 20 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (7, 13) suggest the object might be located near the center of the image. Moving slightly west and lowering will help investigate this area.</Reasoning>\n<Action>(7, 13, -5)</Action>"
    ]
]