[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a campsite.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 39 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Based on the coordinates provided, the object is located at approximately (-0.0, 0.0) in the grid. I need to move to this location while maintaining a safe altitude above any potential obstacles. This position seems to be one of the corners of the grid, and I will start my search by descending slightly towards this area.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have reached coordinates (-0.0, 0.0), which is near the initial spot of the object noted at (0, 0) in the grid. However, the object appears to be over a cluster of rocks, which might obstruct my view. To improve visibility and ensure the object is in my field of view, I will slightly adjust my position to the northeast of this location.</Reasoning>\n<Action>(0, 10, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near the ground at (0, 0), but I am now positioned above a dense area of rocks. I'll move slightly northwest to reduce potential obstruction by rocks and enhance visibility of the object located at (0, 0).</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still within view, and I'm currently positioned directly above it at coordinates (0, 0). To ensure I'm close and centered on the object, I'll gently lower to 10 meters above it, which is the target altitude for when I find the object.</Reasoning>\n<Action>(0, 0, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 19 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to find the object at (6, 6) in the grid. My current position is higher than the target altitude, so I'll move closer to this point and slightly adjust my altitude to be closer to the ground.</Reasoning>\n<Action>(6, 6, -3)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 16 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am near the object at (0, 0) and descending to ensure I am visually centered on it and below 10 meters above. Moving further north/northwest will help me maintain a good viewing angle while approaching.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 5 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm centered on the object at (0, 0), but I'm too close, at just 5 meters above. I need to move slightly north to maintain a good view and control altitude to keep at 10 meters or below.</Reasoning>\n<Action>(0, 3, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 4 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am centered on the object at (0, 0). Since I am already quite close and below 10 meters, I will maintain my position to ensure the object remains in view and confirm it is my target.</Reasoning>\n<Action>(0, 0, 0)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is at coordinates (0, 0), and I am already centered on it. To maintain a good height and perspective, I will slightly lower to ensure I am just above the object without obstructing the view.</Reasoning>\n<Action>(0, 0, -1)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is at coordinates (0, 0), and I am already positioned very close. To ensure I am directly above and close to the object, I will maintain my current altitude and position to confirm it's my target.</Reasoning>\n<Action>(0, 0, 0)</Action> \n<Action>FOUND</Action>"
    ]
]