[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a large trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 63 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this aerial view at 63 meters, I can see a road along the waterfront but no clear trash pile yet. I should conduct a systematic search by moving to a different position and lowering my altitude to get a better view. I'll move towards the south and east section of the visible area while descending to get a clearer view of any potential trash piles.</Reasoning>\n<Action>(21, -21, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>At 33 meters, I have a better view but still need to continue my search. I can see the road and waterfront more clearly now, but no obvious trash pile yet. I'll continue moving south and descend further to get an even closer look at the area.</Reasoning>\n<Action>(0, -22, -20)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 13 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm now at a much lower altitude (13 meters) and getting a clearer view of the area. I can see a parked car, but I should continue searching to the west where there appears to be more ground area visible. I'll move slightly west while maintaining this low altitude to investigate what appears to be some irregular shapes on the ground.</Reasoning>\n<Action>(-9, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 13 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this position, I can see what appears to be a darker area or debris on the ground to the north. I'll move in that direction to investigate further, while maintaining this low altitude since we're already under 15 meters which gives us good visibility.</Reasoning>\n<Action>(-4, 9, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 13 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be a lighter colored patch or debris area on the ground to the southwest of my current position. I'll move towards that area while descending slightly further to get a better look at what might be the trash pile we're searching for.</Reasoning>\n<Action>(-4, -9, -4)</Action>"
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can now see what appears to be the trash pile we're looking for - there's a reddish-colored debris pile visible in the image. I'm at 9 meters altitude which is within our target range of below 10 meters, and the object is clearly in my field of view. I'm positioned well to observe it.</Reasoning>\nFOUND"
    ]
]