[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a forest fire.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 94 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object appears to be near the coordinates (-31, 31) with a distinct dark area, indicating fire activity. I will move closer to this location to verify if it is the fire.</Reasoning>\n<Action>(0, 31, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 83 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I moved too close to the edge of the image, and my field of view is now mostly empty grid. I need to move back to the area near (-31, 31) where the fire was previously detected.</Reasoning>\n<Action>(0, -31, 10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 92 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am directly above the fire, as indicated by the dark smoke near coordinates (31, 31). I will lower my altitude to ensure I am within 10 meters of the fire.</Reasoning>\n<Action>(31, 31, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 81 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is at coordinates (27, 54) as indicated by the dark smoke. I will move closer to verify and lower my altitude.</Reasoning>\n<Action>(0, 54, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 71 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is located near coordinates (24, 24) with dark smoke visible. I will move closer to verify and lower my altitude.</Reasoning>\n<Action>(0, 24, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 61 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The smoke is visible near coordinates (20, 20), indicating the fire's location. I will move closer to verify and lower my altitude.</Reasoning>\n<Action>(0, 20, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 51 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is located near coordinates (17, 34) with visible smoke. I will move closer and lower my altitude to confirm the presence of the fire.</Reasoning>\n<Action>(0, 34, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 41 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is located near coordinates (14, 27) with smoke visible. I will move closer and lower my altitude to confirm the fire's presence.</Reasoning>\n<Action>(0, 27, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 31 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is located near coordinates (10, 21) with visible smoke. I will move closer and lower my altitude to confirm the fire's presence.</Reasoning>\n<Action>(0, 21, -10)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly out of the search area's bounds. You can't fly further than 200 meters from the starting point in any axis."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is located near coordinates (10, 21) with visible smoke. I will move closer and do not exceed the search area bounds.</Reasoning>\n<Action>(0, 21, -5)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly out of the search area's bounds. You can't fly further than 200 meters from the starting point in any axis."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to adjust my course to stay within the search area bounds. I will move slightly west and lower my altitude.</Reasoning>\n<Action>(-10, 21, -5)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly out of the search area's bounds. You can't fly further than 200 meters from the starting point in any axis."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is near coordinates (10, 21) with visible smoke. I will adjust my position and altitude to stay within search area bounds.</Reasoning>\n<Action>(-10, 10, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 26 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is near coordinates (9, 17) with visible smoke. I will move closer and stay within search area bounds.</Reasoning>\n<Action>(0, 17, -5)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly out of the search area's bounds. You can't fly further than 200 meters from the starting point in any axis."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The fire is near coordinates (9, 17) with visible smoke. I will adjust my position to stay within search area bounds.</Reasoning>\n<Action>(-10, 9, -5)</Action>"
    ]
]