[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a large trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 37 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The yellow point (-12, 0) is the most central object on the grid, and it's also the lowest point visible relative to the current position. I should head towards this point to assess if it could be the trash pile.\n\nGiven the information, I need to decrease altitude to ensure I stay below 10 meters above the object if it is indeed the target. This approach keeps me within safe altitude limits and focused on the potential location of the trash pile.\n\nI will move to the point (-12, 0, 0) to center on the yellow object and check if it is the trash pile. If not, I will continue searching.\n\n<Action>(-12, 0, -30)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 7 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The red line indicates the current position is above an area where a large object could be, and it appears to be centered near the point (2, 0). This location is the most promising lead for the trash pile, given its central position and proximity to a large area.\n\nMoving to point (2, 0, 0) to drop down to ground level and center on the potential trash pile. This move aligns with the objective of being close to the object and within the 10-meter limit.\n\n<Action>(2, 0, -30)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now 1 meter above the ground and very close to the ground, which is undesirable as per the emergency stop. I should adjust my altitude to maintain a safe distance from the ground. Moving to point (0, 0, 10) will increase altitude while staying within the search area and not moving outside the visible grid.\n\n<Action>(0, 0, 10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object of interest is still near point (0, 0) but has been shifted down, so I need to adjust my altitude accordingly. Moving to point (0, 0, 0) will allow me to stay close and centered on it while being within the 10-meter limit above the object.\n\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm close to the ground, maintaining a low altitude near the object of interest, which is near the point (0, 0). To ensure I'm still close to the object without hitting the ground, I should slightly increase altitude. Moving to point (0, 0, -5) will help me maintain proximity while avoiding a collision with the ground.\n\n<Action>(0, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am at risk of colliding with the ground again, as my current altitude is 1 meter above the ground. I need to adjust to ensure safety. Moving to point (0, 1, 10) will increase altitude while staying within the area and avoiding a collision.\n\n<Action>(0, 1, 10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object of interest is now at point (0, 4) and is elevated, so I should move slightly upwards and east to center on it. This will help me stay close and centered on the trash pile, maintaining an altitude that keeps me within the 10-meter limit above the object.\n\n<Action>(4, 4, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is still near point (0, 0). To maintain a safe altitude and stay close, I should move slightly upwards to point (0, 0, 0), keeping me close to the ground level without descending below the 10-meter limit.\n\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object of interest appears to be at point (0, 4) and is relatively close to the ground. To center on it and stay within the 10-meter limit, I should slightly increase altitude and move eastward to point (4, 4, 0). This will help me maintain a safe distance and stay focused on the potential trash pile.\n\n<Action>(4, 4, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object of interest appears to be near point (4, 4). To maintain a safe altitude and stay close, I should move slightly upwards and east to point (4, 4, 0), keeping me close to the ground level and within the 10-meter limit.\n\n<Action>(4, 4, 0)</Action>"
    ]
]