[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 97 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to start by examining the area more closely to identify potential trash piles. I'll begin with a small descent to better observe the ground level. Since the coordinates (0, 0) are in the center, it's a logical starting point for searching.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 87 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object containing trash appears to be at coordinate (-58, 0). To accurately locate it and approach, I need to move towards (-58, 0). As the coordinates are to the southwest, I should move in that direction while descending to maintain a closer altitude.</Reasoning>\n<Action>(-58, 0, -15)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 71 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object of interest seems to be located at coordinate (0, 0), as marked by the smaller formation of darker green. To get closer and potentially confirm if it's the trash pile, I need to move directly towards this coordinate.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 60 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The black spot at coordinate (20, 0) might be the trash pile. I should move towards this spot and descend to confirm it's the object of interest.</Reasoning>\n<Action>(20, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 49 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I have located the black spot at coordinate (16, 0), which could potentially be the trash pile. I need to move closer and lower my altitude to confirm it is the object of interest.</Reasoning>\n<Action>(16, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 38 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now close to the potential trash pile at coordinate (16, 0). I need to lower my altitude further to confirm it's the object of interest and ensure I am within 10 meters of it when I find it.</Reasoning>\n<Action>(16, 0, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 27 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The potential trash pile is at coordinate (9, 0). Moving towards this spot and descending will help me confirm it's the object of interest.</Reasoning>\n<Action>(9, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 16 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The trash pile appears to be at coordinate (5, 0). I need to move towards this spot and lower my altitude to confirm it is the object of interest.</Reasoning>\n<Action>(5, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 5 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The potential trash pile is at coordinate (2, 0). Moving in this direction with a slight descent will allow me to confirm if it's the object of interest.</Reasoning>\n<Action>(2, 0, -5)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Action>FOUND</Action>"
    ]
]