[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 89 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I should start by analyzing the center of the grid, which is around the coordinates (0, 0). This area could potentially contain the anomaly since it is centrally located and may have a different height compared to the surrounding points.</Reasoning>\n<Action>(0, 0, -20)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 68 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I should fly a bit lower to better examine the area around the point (0, 0) which might contain the object in question. Given the current height of 68 meters, a small descent should allow me to get closer without risking overshooting.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 57 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object is likely still around the origin (0, 0), as it has been a consistent point of focus. Moving directly down to this point should be a strategic approach to verify if it's the anomaly.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 46 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object appears to be at or near the origin (0, 0) based on the previous grids. I will move slightly to the north to confirm its presence and prepare for a closer inspection.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 45 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Considering the object might be at the origin or nearby based on previous grids, I will hover slightly southward to gain a better view in case it is not at (0, 0).</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 44 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm hovering close to the area where the object might be, especially around (0, 0). Moving slightly west should help me pinpoint it if it's not exactly at the origin.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 43 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I will move a bit lower to assess the area around the origin (0, 0) more closely, as the object could be located there or nearby.</Reasoning>\n<Action>(0, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 37 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object might be centered around the origin (0, 0) or nearby. Moving directly down will help me get a better view if the object is not exactly at the origin.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 26 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object appears to be closer to the origin (0, 0), not directly at it. Moving slightly north will help me center on it if it's near the origin but not at the exact center.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 25 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object might be at or very near the origin (0, 0). I will hover to check this area more closely, moving slightly northeast to be directly above it if it's not at the exact center.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ]
]