[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a road construction site.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am starting the search by moving to a central location on the grid. I will first head to (11, 11), which is the middle of the grid, to ensure I have a broad view of the area to begin my search.</Reasoning>\n<Action>(11, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm moving up to (0, 23) to check the area above and around the intersection where potential road work could be located.</Reasoning>\n<Action>(0, 23, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>There is no visible construction equipment or materials in my current field of view. I need to move slightly to the south to check another section of the street, so I will head to (0, 11).</Reasoning>\n<Action>(0, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am moving to point (0, 11) to continue my search for any signs of road construction, such as materials or equipment.</Reasoning>\n<Action>(0, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am moving to point (0, 11) to check if there is any construction activity near the intersection or on the sidewalk.</Reasoning>\n<Action>(0, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm moving to point (0, 11) to further inspect the sidewalk and street intersection for signs of construction. This location might provide clues about ongoing work.</Reasoning>\n<Action>(0, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am moving slightly east to point (0, 11) to continue searching for signs of road construction on the sidewalk or street intersection.</Reasoning>\n<Action>(0, 11, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm moving to point (0, 23) to check the area above the road and sidewalk. This could potentially be a location where road construction materials or equipment might be stored.</Reasoning>\n<Action>(0, 23, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>There appears to be road work near the intersection. I need to move closer to inspect for construction materials or equipment.</Reasoning>\n<Action>(0, 23, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 34 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am moving to point (0, 23) to get a closer look at the road intersection where road work might be taking place.</Reasoning>\n<Action>(0, 23, 0)</Action>"
    ]
]