[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 73 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to start by analyzing the grid and identifying potential anomalies. In the image, a boat is present near the coordinates (24, 24) and (49, 24), which stand out as they are in the middle of the grid. The boat is not labeled with coordinates like the other markers, which suggests it might be the anomaly. I will move closer to these coordinates to get a better view.</Reasoning>\n<Action>(24, 24, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 63 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I am now closer to the boat's location, which is near coordinates (24, 24) and (49, 24). The boat itself is not labeled, but it fits the description of an anomaly. I need to move slightly east to the next grid line to ensure I am directly above the boat for a closer inspection.</Reasoning>\n<Action>(27, 24, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 63 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is now directly in my field of view. I need to descend to get a closer inspection and determine if it is the anomaly. I will move directly above the boat, which is near coordinates (21, 21).</Reasoning>\n<Action>(21, 21, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 58 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Action>(21, 21, -10)</Action> \n<Reasoning>The boat is directly under me. I will descend to a height of 10 meters to confirm it is the anomaly.</Reasoning> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is directly under me. I will descend to a height of 10 meters to confirm it is the anomaly.</Reasoning>\n<Action>(21, 21, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 38 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is directly under me. I will descend to a height of 10 meters to confirm it is the anomaly.</Reasoning>\n<Action>(21, 21, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 28 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is directly under me. I will descend to a height of 10 meters to confirm it is the anomaly.</Reasoning>\n<Action>(21, 21, -10)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 22 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Action>(0, 0, 112)</Action> \n<Reasoning>I realized I descended too close to an obstruction, so I am now ascending quickly to avoid a collision.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 22 meters, which means that you can only fly 98 meters higher."
    ],
    [
        "Role.ASSISTANT",
        "<Action>(0, 0, 98)</Action> \n<Reasoning>I am ascending to a safe altitude after realizing I descended too close to an obstruction. This will allow me to continue the search without risk of collision.</Reasoning>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 120 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is directly under me, and I need to descend to confirm it is the anomaly.</Reasoning>\n<Action>(21, 21, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 110 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The boat is directly under me, and I need to descend to confirm it is the anomaly.</Reasoning>\n<Action>(21, 21, -10)</Action>"
    ]
]