[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a campsite.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 77 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to conduct a methodical search for the campsite. From this altitude of 77 meters, I can see a large area but might miss smaller details. I notice some clearings in the wooded area that could potentially contain a campsite. I'll start by moving to a central position and reducing altitude to get a better view. I'll move to coordinates (0, 0) and descend 30 meters to get a clearer view while maintaining enough height to continue searching effectively.\n</Reasoning>\n<Action>(0, 0, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 46 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see what appears to be some dark rectangular shapes in the lower portion of the image, which could be tents or camping equipment. I'll move slightly south towards these objects at coordinates (0, -15) and descend another 30 meters to get a closer look. This should help confirm if these are indeed the campsite structures I'm looking for.\n</Reasoning>\n<Action>(0, -15, -30)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 16 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see what appears to be the campsite more clearly in my field of view. I'm at 16 meters altitude which is still too high according to the objective (needs to be below 10 meters). I'll descend another 8 meters to get to 8 meters altitude while maintaining my current horizontal position. This will put me at the required height of less than 10 meters above the target while keeping it centered in my field of view.\n</Reasoning>\n<Action>(0, 0, -8)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can now see the two dark tent-like structures clearly in my field of view. I'm at 8 meters altitude which is within the required range (below 10 meters), and the campsite is centered in my view. This meets all the requirements: the object is in my field of view, I'm centered on it, and I'm below 10 meters altitude.\n</Reasoning>\nFOUND"
    ]
]