[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a large trash pile.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 88 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(0, 0, 128)</Action>\n<Reasoning>I need to adjust my altitude to begin searching closer to the ground level. The maximum altitude is 120 meters, so I must fly higher. I will start at a safe distance from obstacles.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 88 meters, which means that you can only fly 32 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(0, 0, 56)</Action>\n<Reasoning>Adjusting my altitude to 56 meters to be safe and within the limits. This should allow me to search for lower altitude points while avoiding unnecessary risks.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 88 meters, which means that you can only fly 32 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-1, 0, 51)</Action>\n<Reasoning>Since my altitude is restricted to 120 meters, it's safe to fly 1 meter lower to start with. This will allow me to explore the area properly without going too high.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 88 meters, which means that you can only fly 32 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-5, 0, 27)</Action>\n<Reasoning>I'm adjusting my altitude to 27 meters to allow for a better view of the ground. It's critical to be at the right altitude to find the trash pile effectively.</Reasoning>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 115 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-1, 0, 116)</Action>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 115 meters, which means that you can only fly 5 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-5, 0, 110)</Action>\n<Reasoning>I am unable to fly higher than my current altitude of 115 meters. To reduce the drone's altitude, I should move 5 meters lower. This will bring the drone closer to the ground and improve the chances of finding the trash pile.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 115 meters, which means that you can only fly 5 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-10, 0, 105)</Action>\n<Reasoning>To get even closer to the ground, I will need to decrease my altitude further. Moving 10 meters lower will allow me to explore the area more effectively while staying within the altitude limits.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 115 meters, which means that you can only fly 5 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-15, 0, 100)</Action>\n<Reasoning>After decreasing my altitude by another 5 meters, I will be within closer range to the ground. The lower I can fly without compromising safety, the better my chances of finding the trash pile.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 115 meters, which means that you can only fly 5 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-20, 0, 95)</Action>\n<Reasoning>It's time to make another altitude adjustment. I will decrease my altitude by one more meter to 95 meters. This will bring me even closer to the ground. It's crucial to find that trash pile soon.</Reasoning>"
    ],
    [
        "Role.USER",
        "This command would cause you to fly too high. You can't fly higher than 120 meters. Your current altitude is 115 meters, which means that you can only fly 5 meters higher."
    ],
    [
        "Role.ASSISTANT",
        " <Action>(-25, 0, 90)</Action>\n<Reasoning>I'm making a slight altitude decrease to 90 meters. It's essential to be as low as possible to spot the trash pile swiftly. This will allow me to scan the ground more thoroughly.</Reasoning>"
    ]
]