[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 47 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see a commercial aircraft on the ground which appears to be the anomaly in this natural environment. Since I need to get closer to properly inspect it and need to be below 10 meters relative to it, I'll move to position (16, 0) which is near the center of the aircraft and descend by 40 meters. This should put me at about 7 meters above the aircraft, which meets the requirement of being below 10 meters.</Reasoning>\n<Action>(16, 0, -40)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 10 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the unsafe maneuver. I see that we're now very close to the aircraft at 10 meters altitude. Since this appears to be the anomaly we're looking for but we're too close to it for safety, I should move back and up to get a better view of the surrounding area and continue the search in a safer manner.</Reasoning>\n<Action>(-7, -7, 40)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I have a better overview of the area. The aircraft is clearly the anomaly in this natural environment. I need to position myself at a safe distance but still below 10 meters relative to the object. Given that the aircraft is a large object on the ground, I'll move to a position near it at (-17, -17) and descend to about 9 meters above ground level, which should put me at a safe distance while still being below 10 meters relative to the target.</Reasoning>\n<Action>(-17, -17, -41)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>From this new position, I've lost sight of the aircraft. I need to move back to where I can see it clearly. I'll move towards (17, 17) and maintain my current altitude of 9 meters, which should give me a good view of the aircraft while staying below 10 meters relative to it.</Reasoning>\n<Action>(17, 17, 0)</Action>"
    ],
    [
        "Role.USER",
        "This command would endanger the drone, as you would fly out of bounds of the last seen image, possibly flying into unknown territories, recklessly. Please adjust your command so that you don't fly out of bounds of the last glimpse."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I apologize for the unsafe command. You're right - I should only move within the bounds of what I can see in the current image. Looking at the grid, I can see coordinates from (-6,6) to (6,6). I'll move to (6,6) which is within my visible range, and this should help me get back towards the direction of the aircraft while maintaining safe operations.</Reasoning>\n<Action>(6, 6, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I still don't see the aircraft from this position. Since I need to get back to where the aircraft was, and I know it was north of my current position, I'll move towards (0, 6) which is at the top of my current visible range. This should help me get closer to where the aircraft was while maintaining safe operations within visible bounds.</Reasoning>\n<Action>(0, 6, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm still not seeing the aircraft. Since I know it was further north, and I'm currently too low to get a good overview of the area, I should increase my altitude temporarily to get a better view of the surrounding area. I'll maintain my current position but ascend to 50 meters to get a better view of where I need to go next.</Reasoning>\n<Action>(0, 6, 41)</Action>"
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I can see the aircraft again! Since I need to be below 10 meters relative to it but also maintain a safe distance, I'll position myself at (0, 17) which is near the aircraft but not dangerously close, and descend to 9 meters. This should put me at a good observation point while meeting the requirement of being below 10 meters relative to the target.</Reasoning>\n<Action>(0, 17, -41)</Action>"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I see we're now under the wing of the aircraft, which is not a safe position. I need to move to a position where I can see the entire aircraft while maintaining a safe distance. I'll move to (-6, -6) to get away from being under the aircraft while staying at my current altitude.</Reasoning>\n<Action>(-6, -6, 0)</Action>"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 9 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>We've ended up in some vegetation and lost sight of the aircraft again. Since we know the aircraft is the anomaly and we need a clear view of it, I'll first gain some altitude to get our bearings, moving up to 50 meters while staying in the same position. This should help us see over the vegetation and locate the aircraft again.</Reasoning>\n<Action>(-6, -6, 41)</Action>"
    ],
    [
        "Role.USER",
        "Image 10:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Now I have a clear view of the aircraft again. I need to position myself at a safe distance while being below 10 meters relative to it. I'll move to (-17, 17), which puts me at a diagonal to the aircraft's nose, and descend to 9 meters. This position should give me a clear view while maintaining a safe distance.</Reasoning>\n<Action>(-17, 17, -41)</Action>\nFOUND"
    ]
]