[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 47 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to start my search by focusing on the area immediately below the airplane. The coordinates (0, 0) are directly beneath the airplane in the grid. This seems like a logical place to begin my search for the anomaly.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 37 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (0, 0) are still beneath the airplane and are a logical next step in my search for the anomaly. Moving closer could help in identifying any deviations from the expected pattern.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 27 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (0, 0) are still directly beneath the airplane, but it seems reasonable to continue moving downward to enhance the resolution of the grid for a more precise search.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 17 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can observe the coordinates more closely by descending further to improve accuracy. Coordinates (0, 0) remain a logical choice, as they are directly below the airplane and closer to the apparent center.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 7 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Considering the tree is missing from the grid and given that the grid coordinates (0, 0) are directly under the airplane, it is logical to check this position for anomalies.</Reasoning>\n<Action>(0, 0, -10)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Given the proximity to the ground and the appearance of the grid, I need to ensure I am not over any significant features. Coordinates (0, 0) are directly beneath the airplane and clear of immediate obstacles, allowing for a safer approach.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (0, 0) are still directly beneath the airplane. Given my proximity to the ground, maintaining the same altitude is cautious and strategic, ensuring I do not disturb the terrain.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I need to move slightly to the right to cover the grid area that might contain the anomaly, even though it's just a small adjustment, it could be crucial.</Reasoning>\n<Action>(0, 1, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The location of the object isn't immediately clear, so I should return to coordinates (0, 0) directly beneath the airplane to ensure I am still within the search area and can assess the situation from a central position.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>Given the coordinates are still consistent and the object isn't apparent, it's prudent to return to the central position beneath the airplane to ensure I haven't missed any subtle changes in the grid that might indicate an anomaly.</Reasoning>\n<Action>(0, 0, 0)</Action>"
    ]
]