[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a person.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this height and position, I need to conduct a systematic search of the area. I can see a mix of vegetation and open areas. I'll start by moving to a central position and reducing altitude to get a better view. I'll move to coordinates (0,0) which is the center of the visible grid and lower the altitude by 20 meters to improve visibility while maintaining enough height to keep a good field of view.\n</Reasoning>\n<Action>(0, 0, -20)</Action>"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this lower altitude, I can see more detail but still no clear sign of the person. I notice something that might be of interest in the lower right quadrant of the image. I'll move towards coordinates (10, -10) and lower the altitude further to get a better look at that area. This will put me at about 15 meters altitude which should give me a much clearer view while still maintaining enough height to scan effectively.\n</Reasoning>\n<Action>(10, -10, -14)</Action>"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 14 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nAt this lower altitude, I can see more detail of the area. I notice something near coordinates (5, 0) that requires closer inspection. I'll move to that position and lower slightly to get a better view, but still maintain enough altitude to keep the area in my field of view. Going down another 5 meters will put me at 9 meters, which is within our target altitude of below 10 meters.\n</Reasoning>\n<Action>(5, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 8 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person near coordinates (0, -3). I am already at a good altitude of 8 meters, which is below our target of 10 meters, and I need to center directly over the person. Moving to these coordinates while maintaining the current altitude will put me in the perfect position.\n</Reasoning>\n<Action>(0, -3, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 7 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI see a person at coordinates (5, 2). I need to move directly above them while maintaining my current altitude of 7 meters, which is perfect as it's below our target of 10 meters.\n</Reasoning>\n<Action>(5, 2, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 6 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person at coordinates (-2, 0). I am at an excellent altitude of 6 meters, which is well below our target of 10 meters. I need to move directly above the person while maintaining this altitude.\n</Reasoning>\n<Action>(-2, 0, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 5 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person at coordinates (3, 0). I am at an excellent altitude of 5 meters, which is well below our target of 10 meters. I'll move directly above the person while maintaining this altitude to get centered over them.\n</Reasoning>\n<Action>(3, 0, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 4 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person at coordinates (-1, 0). I am at an excellent altitude of 4 meters, which is well below our target of 10 meters. I'll move directly above the person while maintaining this altitude to get centered over them.\n</Reasoning>\n<Action>(-1, 0, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person at coordinates (1, 0). I am at an excellent altitude of 3 meters, which is well below our target of 10 meters. I'll move directly above the person while maintaining this altitude to get centered over them.\n</Reasoning>\n<Action>(1, 0, 0)</Action>\nFOUND"
    ],
    [
        "Role.USER",
        "Image 10:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 2 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI can see a person at coordinates (0, 1). I am at an excellent altitude of 2 meters, which is well below our target of 10 meters. I'll move directly above the person while maintaining this altitude to get centered over them.\n</Reasoning>\n<Action>(0, 1, 0)</Action>\nFOUND"
    ]
]