[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding an object that doesn't fit in with the rest of the environment (an anomaly).\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 41 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The object seems to be located at (0, 14) on the grid, as the coordinates (0, 14, 0) are among the lowest and have the smallest positive y-value. I will move towards this location to check if it's the object.</Reasoning>\n<Action>(0, 14, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 36 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm currently focusing on the area around (0, 14), but the coordinates (0, 24) also suggest another potential location for the object. I need to check both areas. I'll move towards (0, 24) next, as it might also be the anomaly.</Reasoning>\n<Action>(0, 24, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 31 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm currently focused on the area around (0, 24), but the coordinates (0, 24, 0) are among the lowest and also have the smallest positive y-value, suggesting it could be the object. I'll move towards this location to investigate further.</Reasoning>\n<Action>(0, 24, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 26 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I just moved to the area around (0, 24), but the coordinates (0, 9) are among the lowest, suggesting it could be the object. I'll move towards this location to investigate further.</Reasoning>\n<Action>(0, 9, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 21 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm currently focused on the area around (0, 9), which is one of the lowest points on the grid. This suggests it could be the object. I'll move towards this location to investigate further.</Reasoning>\n<Action>(0, 9, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 16 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm currently focusing on the area around (0, 9), but the coordinates (0, 5) are among the lowest, suggesting it could also be the object. I'll move towards this location to investigate further.</Reasoning>\n<Action>(0, 5, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 11 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm currently focused on the area around (0, 5), but there are no coordinates with a y-value of 0, which is essential for it to be the object. I'll continue the search and move towards the lowest point, (0, 0), to ensure I don't miss the object.</Reasoning>\n<Action>(0, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 6 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I've just moved over the area around (0, 0) and found a yellow spot, which is likely the object. I need to get closer to confirm and ensure I am below 10 meters above it.</Reasoning>\n<Action>(0, 0, -1)</Action> \n<Action>FOUND</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 5 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I've moved to the area around (0, 0), but there are no coordinates indicating a y-value of 0, so I need to continue searching. The coordinates (0, 0) are still a potential location, so I'll verify it by getting closer.</Reasoning>\n<Action>(0, 0, -5)</Action>"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The coordinates (0, 0) are still a potential location for the object, and the highest point on the grid is at y=0, aligning with the coordinates. I'll move towards (0, 0) to confirm it's the object.</Reasoning>\n<Action>(0, 0, -1)</Action>"
    ]
]