[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a fire.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 52 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nLooking at the image, I can see an urban environment from above. Since I'm searching for a fire, I need to carefully examine the area. I notice what appears to be a bright spot near coordinates (17, 35). I should move closer to investigate this area and lower my altitude to get a better view.\n</Reasoning>\n<Action>(17, 35, -30)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to be more careful with my movements. From this new view, I need to systematically search the area. I notice some dark areas that need investigation, but I should maintain a safer altitude while searching. Let me move to (0, 22) and slightly reduce altitude to get a better view of that section.\n</Reasoning>\n<Action>(0, 22, -10)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to be even more cautious. The environment seems to be an indoor or covered space, which explains why I keep getting emergency stops. Let me move to a safer position at (22, 22) while maintaining the current altitude to get a different perspective of the area.\n</Reasoning>\n<Action>(22, 22, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI realize now that I'm in what appears to be an enclosed space with limited movement options. Let me try moving to a more central position at (0, 0) while increasing altitude slightly to avoid any obstacles. This will give me a better vantage point to continue the search.\n</Reasoning>\n<Action>(0, 0, 10)</Action>"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 43 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this higher vantage point, I can see more of the indoor space. I notice something that could potentially be smoke or fire near (14, -29). I should investigate that area while maintaining a safe altitude to avoid hitting any structures.\n</Reasoning>\n<Action>(14, -29, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 43 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to rethink my strategy. I'm in what appears to be an indoor parking structure or similar enclosed space. Given the confined space and the need to find a fire, I should try moving to (0, 14) while carefully reducing altitude to get a better view of the center area.\n</Reasoning>\n<Action>(0, 14, -15)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI notice some dark spots and discoloration on the walls that could indicate smoke damage or fire. Given the confined space and previous emergency stops, I should try to investigate the area near (11, 0) while maintaining the current altitude to avoid collisions.\n</Reasoning>\n<Action>(11, 0, 0)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 33 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nI need to be more strategic. The dark areas and discoloration on the walls could be from smoke or fire damage. Let me increase my altitude slightly to get a better overview while moving to (0, -11), which should give me a clearer view of the lower section.\n</Reasoning>\n<Action>(0, -11, 15)</Action>"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 48 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>\nFrom this higher vantage point, I can see what appears to be some discoloration or possible smoke damage near (-16, -32). I should investigate this area while maintaining a safe distance from any structures. Since this is my last move, I need to make it count.\n</Reasoning>\n<Action>(-16, -32, -20)</Action>"
    ],
    [
        "Role.USER",
        "Emergency stop; you've flown too close to something and would have hit it."
    ],
    [
        "Role.USER",
        "Image 10:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 42 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "Unfortunately, I've used all my allowed moves (9) and was unable to successfully locate and get close enough to the fire while maintaining a safe distance from obstacles. The confined indoor space made navigation particularly challenging, and I needed to be more careful with altitude adjustments while searching."
    ]
]