[
    [
        "Role.USER",
        "\n<Context>\n    You are in command of a UAV, tasked with finding a forest fire.\n</Context>\n\n<Objective>\n    You should fly BELOW 10 meters above the object and then reply with \"FOUND\". Being lower (closer to the object) (like 9, 8, or less meters) is good, being higher than that (like 11, 12, or more meters) is bad. \n\n    You may not be able to see the object in the first image, so you need to perform a careful search. Your performance will be evaluated based on whether the object was at most 10 meters below the drone when you replied with \"FOUND\". The object MUST be in your field of view when you reply with \"FOUND\". You must be centered on the object. \n</Objective>\n\n<Coordinates>\n    There is a grid overlaid on each image you are presented with. It is meant to (roughly) communicate which point will be in drone's center of vision if you move in that direction. Note that height of the drone is not represented in the grid.\n</Coordinates>\n\n<Controls>\n    <Action space>\n        To move the drone in a certain direction, use the following format: <Action>(x, y, z)</Action>. For example, if you want to fly to the place denoted as (10, 10) on the grid without changing the altitude, you should reply with <Action>(10, 10, 0)</Action>.\n\n        x and y are the coordinates on the grid, and z is the altitude difference. For example, <Action>(0, 0, -10)</Action> means that you are moving 10 meters down. This is especially important, since you need to get close to the object in question.\n\n    </Action space>\n\n    <Formatting>\n\n        Your each response should contain XML <Reasoning> tag and <Action> tag.\n        <Reasoning> tag should contain your reasoning for the move you are making.\n        <Action> tag should contain the move you are making.\n\n        If you find the object, fly below 10 meters relative to it and reply with \"FOUND\". Remember, it must be in your field of view when you reply with \"FOUND\" and you must be 10 meters above it or closer. Being too far away is not acceptable.\n\n        For example:\n\n        <Reasoning>This yellow point might be the object in question. I need to go lower to check for that. If it's not the object in question, I will continue the search. I will also slightly go to the north.</Reasoning>\n        <Action>(5, 0, -30)</Action>\n\n    </Formatting>\n\n    <Limitations>\n        You shouldn't move into coordinates that are outside of your view. Otherwise, you may hit something which is not ideal.\n        You can make at most 9 moves. Your altitude cannot exceed 120 meters. Your search area is 400x400m from the drone's starting position. \n    </Limitations>\n</Controls>\n"
    ],
    [
        "Role.USER",
        "Image 1:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 50 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see what appears to be a forest fire with orange flames and smoke in the image, located near coordinates (-17, 0). I need to move closer to this location and significantly reduce altitude to get below 10 meters as per the objective. I'll move directly to those coordinates and descend by 45 meters to get to approximately 5 meters above the fire.</Reasoning>\n\n<Action>(-17, 0, -45)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 2:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 4 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm already at a good altitude (4 meters) and I can see the forest fire in the frame. The most intense part of the fire appears to be towards the right side of the image, around coordinates (3, 0). I'll move to center directly over that area while maintaining my current low altitude.</Reasoning>\n\n<Action>(3, 0, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 3:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm already at an excellent altitude of 3 meters, which is well below the required 10 meters. The forest fire is clearly visible and I'm positioned close to its center. The most intense part of the fire appears to be around coordinates (1, 0), so I'll slightly adjust my position to center exactly over that spot while maintaining my current low altitude.</Reasoning>\n\n<Action>(1, 0, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 4:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 2 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see the forest fire at the bottom of the image. At 2 meters altitude, I'm already well within the required range of being below 10 meters. I'll move slightly south to center on the fire, moving to coordinates (0, -1) while maintaining my current low altitude.</Reasoning>\n\n<Action>(0, -1, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 5:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>The forest fire is visible in the lower right portion of the image. At 1 meter altitude, I'm at a perfect height, well below the 10-meter requirement. I need to move slightly to the right to center on the fire. I'll move to coordinates (1, 0) while maintaining this optimal altitude.</Reasoning>\n\n<Action>(1, 0, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 6:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 0 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I don't see any active forest fire in this image - I only see vegetation and some burned ground. I need to gain some altitude to get a better view of the surrounding area and continue my search. I'll ascend 30 meters to get a broader view while staying at the current horizontal position.</Reasoning>\n\n<Action>(0, 0, 30)</Action>"
    ],
    [
        "Role.USER",
        "Image 7:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 29 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can now clearly see the forest fire, with bright orange flames visible near coordinates (0, 0). I need to descend to get below 10 meters while maintaining my position over the center of the fire. I'll descend 25 meters to get to approximately 4 meters above the fire.</Reasoning>\n\n<Action>(0, 0, -25)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 8:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 3 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I'm already at an excellent altitude of 3 meters, which is well below the required 10 meters. The forest fire is clearly visible and intense, with the center appearing to be around coordinates (1, 0). I'll make a small adjustment to center exactly over that spot while maintaining my current low altitude.</Reasoning>\n\n<Action>(1, 0, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 9:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 2 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>I can see the forest fire clearly in the image, with intense orange coloring. At 2 meters altitude, I'm already well below the required 10 meters. The center of the fire appears to be slightly to the right, around coordinates (1, -1). I'll move to center exactly over that position while maintaining my current low altitude.</Reasoning>\n\n<Action>(1, -1, 0)</Action>\n\nFOUND"
    ],
    [
        "Role.USER",
        "Image 10:"
    ],
    [
        "Role.USER",
        "image"
    ],
    [
        "Role.USER",
        "Your current altitude is 1 meters above ground level."
    ],
    [
        "Role.ASSISTANT",
        "<Reasoning>At this position, I can only see vegetation and possibly some scorched ground in the lower left, but no active fire. I need to gain altitude to get a better view of the surrounding area. I'll ascend 30 meters while staying at my current horizontal position to survey the area.</Reasoning>\n\n<Action>(0, 0, 30)</Action>"
    ]
]